podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/XCVR_MISC_MKW41Z4.svd.xml
            <register>
               <name>FAD_CTRL</name>
               <description>FAD CONTROL</description>
               <addressOffset>0x24</addressOffset>
               <resetValue>0xF080</resetValue>
               <fields>
                  <field>
                     <name>FAD_EN</name>
                     <description>Fast Antenna Diversity Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Fast Antenna Diversity disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Fast Antenna Diversity enabled for 802.15.4</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ANTX</name>
                     <description>Antenna Selection State</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ANTX_EN</name>
                     <description>FAD Antenna Controls Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>all disabled (held low)</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>only RX/TX_SWITCH enabled</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>only ANT_A/B enabled</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>all enabled</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ANTX_HZ</name>
                     <description>FAD PAD Tristate Control</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>ANT_A, ANT_B, RX_SWITCH and TX_SWITCH are actively driven outputs</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Antenna controls high impedance- Set ANT_A, ANT_B, RX_SWITCH and TX_SWITCH in high impedance</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ANTX_CTRLMODE</name>
                     <description>Antenna Diversity Control Mode</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ANTX_POL</name>
                     <description>FAD Antenna Controls Polarity</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>FAD_NOT_GPIO</name>
                     <description>FAD versus GPIO Mode Selector</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LPPS_CTRL</name>
               <description>LOW POWER PREAMBLE SEARCH CONTROL</description>
               <addressOffset>0x28</addressOffset>
               <resetValue>0x64260000</resetValue>
               <fields>
                  <field>
                     <name>LPPS_ENABLE</name>
                     <description>LPPS_ENABLE</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPPS_TZA_ALLOW</name>
                     <description>LPPS_TZA_ALLOW</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPPS_BBA_ALLOW</name>
                     <description>LPPS_BBA_ALLOW</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPPS_ADC_ALLOW</name>
                     <description>LPPS_ADC_ALLOW</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPPS_DCOC_ALLOW</name>
                     <description>LPPS_DCOC_ALLOW</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPPS_PDET_ALLOW</name>
                     <description>LPPS_PDET_ALLOW</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPPS_SY_LO_ALLOW</name>
                     <description>LPPS_SY_LO_ALLOW</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPPS_SY_LO_BUF_ALLOW</name>
                     <description>LPPS_SY_LO_BUF_ALLOW</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPPS_RX_DIG_ALLOW</name>
                     <description>LPPS_RX_DIG_ALLOW</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPPS_DCOC_DIG_ALLOW</name>
                     <description>LPPS_DCOC_DIG_ALLOW</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPPS_START_RX</name>
                     <description>LPPS Fast TSM RX Warmup &quot;Jump-from&quot; Point</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LPPS_DEST_RX</name>
                     <description>LPPS Fast TSM RX Warmup &quot;Jump-to&quot; Point</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RF_NOT_ALLOWED_CTRL</name>
               <description>WIFI COEXISTENCE CONTROL</description>
               <addressOffset>0x2C</addressOffset>
               <fields>
                  <field>
                     <name>RF_NOT_ALLOWED_NO_TX</name>
                     <description>RF_NOT_ALLOWED_NO_TX</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Assertion on RF_NOT_ALLOWED has no effect on TX</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Assertion on RF_NOT_ALLOWED can abort TX</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RF_NOT_ALLOWED_NO_RX</name>
                     <description>RF_NOT_ALLOWED_NO_RX</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Assertion on RF_NOT_ALLOWED has no effect on RX</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Assertion on RF_NOT_ALLOWED can abort RX</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RF_NOT_ALLOWED_ASSERTED</name>
                     <description>RF_NOT_ALLOWED_ASSERTED</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Assertion on RF_NOT_ALLOWED has not occurred</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Assertion on RF_NOT_ALLOWED has occurred since the last time this bit was cleared</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RF_NOT_ALLOWED_TX_ABORT</name>
                     <description>RF_NOT_ALLOWED_TX_ABORT</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>A TX abort due to assertion on RF_NOT_ALLOWED has not occurred</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>A TX abort due to assertion on RF_NOT_ALLOWED has occurred since the last time this bit was cleared</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RF_NOT_ALLOWED_RX_ABORT</name>
                     <description>RF_NOT_ALLOWED_RX_ABORT</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>A RX abort due to assertion on RF_NOT_ALLOWED has not occurred</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>A RX abort due to assertion on RF_NOT_ALLOWED has occurred since the last time this bit was cleared</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RF_NOT_ALLOWED</name>
                     <description>RF_NOT_ALLOWED</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRCW_CFG</name>
               <description>CRC/WHITENER CONTROL</description>
               <addressOffset>0x30</addressOffset>
               <resetValue>0x1</resetValue>
               <fields>
                  <field>
                     <name>CRCW_EN</name>
                     <description>CRC calculation enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRC_ZERO</name>
                     <description>CRC zero</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CRC_EARLY_FAIL</name>
                     <description>CRC error correction fail</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CRC_RES_OUT_VLD</name>
                     <description>CRC result output valid</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CRC_EC_OFFSET</name>
                     <description>CRC error correction offset</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>11</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CRC_EC_DONE</name>
                     <description>CRC error correction done</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CRC_EC_FAIL</name>
                     <description>CRC error correction fail</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRC_EC_MASK</name>
               <description>CRC ERROR CORRECTION MASK</description>
               <addressOffset>0x34</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CRC_EC_MASK</name>
                     <description>CRC error correction mask</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRC_RES_OUT</name>
               <description>CRC RESULT</description>
               <addressOffset>0x38</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CRC_RES_OUT</name>
                     <description>CRC result output</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
